In [2]:
import pandas as pd
import numpy as np
directory_1='C:\\Users\\poll\\zzz_Data_science\\1_intro_TO_DS_karpov\\'

# 1.4 ==========================================================

In [3]:
stud_perform=pd.read_csv(directory_1+'PD_pract\\StudentsPerformance.csv')

In [4]:
stud_perform.head(10)#tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [5]:
stud_perform.iloc[0:5,0:5]#==stud_perform.loc[0:4,0:5]???
#stud_perform.iloc[[0, 5, 10],[0, 5, -1]]#0 5 10 строки и столбцы

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none
3,male,group A,associate's degree,free/reduced,none
4,male,group C,some college,standard,none

In [6]:
stud_perform.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [7]:
stud_perform.groupby('gender').aggregate({'writing score': 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [8]:
stud_perform.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [9]:
stud_perform.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [10]:
stud_perform.shape

(1000, 8)

In [11]:
stud_perform.size

8000

In [12]:
#stud_perform.get_dtype_counts()
stud_perform.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [13]:
stud_perform_names=stud_perform.iloc[[0,3,4,7,8]]

stud_perform_names.index=['Cersei','Tywin','Gregor','Joffrey','Payne']

stud_perform_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Payne,male,group D,high school,free/reduced,completed,64,64,67

In [14]:
stud_perform_names.loc[['Cersei','Tywin'],['gender','writing score']]

        gender  writing score
Cersei  female             74
Tywin     male             44

In [15]:
stud_perform_names.iloc[:,0]
#type(stud_perform_names.iloc[:,0])#type - pd.serie

Cersei     female
Tywin        male
Gregor       male
Joffrey      male
Payne        male
Name: gender, dtype: object

In [16]:
my_series_1=pd.Series([1, 2, 3],index=['Cersei','Tywin','Gregor'])

my_series_2=pd.Series([4, 5, 6],index=['Cersei','Tywin','Gregor'])

In [17]:
pd.DataFrame({'col_name_1':my_series_1,'col_name_2':my_series_2})

        col_name_1  col_name_2
Cersei           1           4
Tywin            2           5
Gregor           3           6

In [18]:
stud_perform_names['gender']

Cersei     female
Tywin        male
Gregor       male
Joffrey      male
Payne        male
Name: gender, dtype: object

In [19]:
stud_perform_names[['gender']]

         gender
Cersei   female
Tywin      male
Gregor     male
Joffrey    male
Payne      male

In [20]:
stud_perform_names.dtypes.value_counts()

object    5
int64     3
dtype: int64

In [21]:
test3=pd.read_csv(directory_1+'ML_datas\\titanic\\titanic.csv')
test3.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64